OpenEVSE/openevse_esp32_firmware/sdkconfig.defaults.esp32s3
#
# Virtual file system
#
CONFIG_VFS_SUPPORT_IO=y
CONFIG_VFS_SUPPORT_DIR=y
CONFIG_VFS_SUPPORT_SELECT=y
CONFIG_VFS_SUPPRESS_SELECT_DEBUG_OUTPUT=y
# CONFIG_VFS_SELECT_IN_RAM is not set
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_VFS_MAX_COUNT=8

#
# Host File System I/O (Semihosting)
#
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=1
# end of Host File System I/O (Semihosting)

CONFIG_VFS_INITIALIZE_DEV_NULL=y
# end of Virtual file system

#
# Wear Levelling
#
# CONFIG_WL_SECTOR_SIZE_512 is not set
CONFIG_WL_SECTOR_SIZE_4096=y
CONFIG_WL_SECTOR_SIZE=4096
# end of Wear Levelling

#
# Wi-Fi Provisioning Manager
#
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=16
CONFIG_WIFI_PROV_AUTOSTOP_TIMEOUT=30
# CONFIG_WIFI_PROV_BLE_BONDING is not set
CONFIG_WIFI_PROV_BLE_SEC_CONN=y
# CONFIG_WIFI_PROV_BLE_FORCE_ENCRYPTION is not set
# CONFIG_WIFI_PROV_BLE_NOTIFY is not set
# CONFIG_WIFI_PROV_KEEP_BLE_ON_AFTER_PROV is not set
CONFIG_WIFI_PROV_STA_ALL_CHANNEL_SCAN=y
# CONFIG_WIFI_PROV_STA_FAST_SCAN is not set
# end of Wi-Fi Provisioning Manager

#
# cJSON
#
CONFIG_CJSON_NESTING_LIMIT=1000
CONFIG_CJSON_CIRCULAR_LIMIT=10000
# end of cJSON

#
# CMake Utilities
#
# CONFIG_CU_RELINKER_ENABLE is not set
# CONFIG_CU_DIAGNOSTICS_COLOR_NEVER is not set
CONFIG_CU_DIAGNOSTICS_COLOR_ALWAYS=y
# CONFIG_CU_DIAGNOSTICS_COLOR_AUTO is not set
# CONFIG_CU_GCC_LTO_ENABLE is not set
# CONFIG_CU_GCC_STRING_1BYTE_ALIGN is not set
# end of CMake Utilities

#
# DSP Library
#
CONFIG_DSP_OPTIMIZATIONS_SUPPORTED=y
# CONFIG_DSP_ANSI is not set
CONFIG_DSP_OPTIMIZED=y
CONFIG_DSP_OPTIMIZATION=1
# CONFIG_DSP_MAX_FFT_SIZE_512 is not set
# CONFIG_DSP_MAX_FFT_SIZE_1024 is not set
# CONFIG_DSP_MAX_FFT_SIZE_2048 is not set
CONFIG_DSP_MAX_FFT_SIZE_4096=y
# CONFIG_DSP_MAX_FFT_SIZE_8192 is not set
# CONFIG_DSP_MAX_FFT_SIZE_16384 is not set
# CONFIG_DSP_MAX_FFT_SIZE_32768 is not set
CONFIG_DSP_MAX_FFT_SIZE=4096
# end of DSP Library

#
# Modbus configuration
#
CONFIG_FMB_COMM_MODE_TCP_EN=y
CONFIG_FMB_TCP_PORT_DEFAULT=502
CONFIG_FMB_TCP_PORT_MAX_CONN=5
CONFIG_FMB_TCP_CONNECTION_TOUT_SEC=2
CONFIG_FMB_TCP_KEEP_ALIVE_TOUT_SEC=4
CONFIG_FMB_TCP_EVENT_WAIT_MS=50
CONFIG_FMB_TCP_READ_TIMEOUT_MS=50
CONFIG_FMB_TCP_SEND_TIMEOUT_MS=100
CONFIG_FMB_TCP_EVENT_LOOP_TICK_MS=50
# CONFIG_FMB_TCP_UID_ENABLED is not set
CONFIG_FMB_COMM_MODE_RTU_EN=y
CONFIG_FMB_COMM_MODE_ASCII_EN=y
CONFIG_FMB_MASTER_TIMEOUT_MS_RESPOND=5000
CONFIG_FMB_MASTER_MAX_API_BLOCKING_TIME_MS=6000
CONFIG_FMB_MASTER_DELAY_MS_CONVERT=200
CONFIG_FMB_QUEUE_LENGTH=50
CONFIG_FMB_PORT_TASK_STACK_SIZE=4096
CONFIG_FMB_BUFFER_SIZE=260
CONFIG_FMB_SERIAL_ASCII_BITS_PER_SYMB=8
CONFIG_FMB_SERIAL_ASCII_TIMEOUT_RESPOND_MS=1000
CONFIG_FMB_PORT_TASK_PRIO=10
# CONFIG_FMB_PORT_TASK_AFFINITY_NO_AFFINITY is not set
CONFIG_FMB_PORT_TASK_AFFINITY_CPU0=y
# CONFIG_FMB_PORT_TASK_AFFINITY_CPU1 is not set
CONFIG_FMB_PORT_TASK_AFFINITY=0x0
# CONFIG_FMB_CONTROLLER_SLAVE_ID_SUPPORT is not set
CONFIG_FMB_CONTROLLER_NOTIFY_TIMEOUT=20
CONFIG_FMB_CONTROLLER_NOTIFY_QUEUE_SIZE=20
CONFIG_FMB_CONTROLLER_STACK_SIZE=4096
CONFIG_FMB_EVENT_QUEUE_TIMEOUT=20
# CONFIG_FMB_TIMER_USE_ISR_DISPATCH_METHOD is not set
# CONFIG_FMB_EXT_TYPE_SUPPORT is not set
CONFIG_FMB_FUNC_HANDLERS_MAX=16
# CONFIG_FMB_COMPILER_STATIC_ANALYZER_ENABLE is not set
CONFIG_FMB_MDNS_INTEGRATION_ENABLE=y
# end of Modbus configuration

#
# ESP serial flasher
#
CONFIG_SERIAL_FLASHER_MD5_ENABLED=y
CONFIG_SERIAL_FLASHER_RESET_HOLD_TIME_MS=100
CONFIG_SERIAL_FLASHER_BOOT_HOLD_TIME_MS=50
# end of ESP serial flasher

#
# Zigbee
#
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCZR=y
# CONFIG_ZB_ZED is not set
# CONFIG_ZB_RADIO_NATIVE is not set
CONFIG_ZB_RADIO_SPINEL_UART=y

#
# Zigbee Example
#
# end of Zigbee Example

# CONFIG_ZB_DEBUG_MODE is not set
# end of Zigbee

#
# Camera configuration
#
CONFIG_OV7670_SUPPORT=y
CONFIG_OV7725_SUPPORT=y
CONFIG_NT99141_SUPPORT=y
CONFIG_OV2640_SUPPORT=y
CONFIG_OV3660_SUPPORT=y
CONFIG_OV5640_SUPPORT=y
# CONFIG_CAMERA_AF_SUPPORT is not set
CONFIG_GC2145_SUPPORT=y
CONFIG_GC032A_SUPPORT=y
CONFIG_GC0308_SUPPORT=y
CONFIG_BF3005_SUPPORT=y
CONFIG_BF20A6_SUPPORT=y
# CONFIG_SC101IOT_SUPPORT is not set
CONFIG_SC030IOT_SUPPORT=y
# CONFIG_SC031GS_SUPPORT is not set
CONFIG_HM1055_SUPPORT=y
CONFIG_HM0360_SUPPORT=y
CONFIG_MEGA_CCM_SUPPORT=y
# CONFIG_SCCB_HARDWARE_I2C_DRIVER_LEGACY is not set
CONFIG_SCCB_HARDWARE_I2C_DRIVER_NEW=y
# CONFIG_SCCB_HARDWARE_I2C_PORT0 is not set
CONFIG_SCCB_HARDWARE_I2C_PORT1=y
CONFIG_SCCB_CLK_FREQ=100000
# CONFIG_GC_SENSOR_WINDOWING_MODE is not set
CONFIG_GC_SENSOR_SUBSAMPLE_MODE=y
CONFIG_CAMERA_TASK_STACK_SIZE=4096
CONFIG_CAMERA_CORE0=y
# CONFIG_CAMERA_CORE1 is not set
# CONFIG_CAMERA_NO_AFFINITY is not set
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=32768
# CONFIG_CAMERA_PSRAM_DMA is not set
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_AUTO=y
# CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_CUSTOM is not set
# CONFIG_CAMERA_CONVERTER_ENABLED is not set
# CONFIG_LCD_CAM_ISR_IRAM_SAFE is not set
# end of Camera configuration

#
# Espressif Camera Sensors Configurations
#

#
# Camera Sensor Configuration
#

#
# Select and Set Camera Sensor
#
# CONFIG_CAMERA_BF3901 is not set
CONFIG_CAMERA_BF3925=y

#
# Auto detect BF3925
#
CONFIG_CAMERA_BF3925_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect BF3925

#
# Choose supported formats for DVP interface
#
CONFIG_CAMERA_BF3925_DVP_YUV422_1600X1200_9FPS=y
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_BF3925_DVP_DEFAULT_FMT_YUV422_1600X1200_9FPS=y
CONFIG_CAMERA_BF3925_DVP_IF_FORMAT_INDEX_DEFAULT=0
CONFIG_CAMERA_BF3A03=y

#
# Auto detect BF3A03
#
CONFIG_CAMERA_BF3A03_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect BF3A03

#
# Choose supported formats for DVP interface
#
# CONFIG_CAMERA_BF3A03_DVP_YUV422_640X480_15FPS is not set
# CONFIG_CAMERA_BF3A03_DVP_YUV422_MONO_640X480_15FPS is not set
CONFIG_CAMERA_BF3A03_DVP_YUV422_YUYV_640X480_15FPS=y
# CONFIG_CAMERA_BF3A03_DVP_YUV422_YUYV_MONO_640X480_15FPS is not set
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_BF3A03_DVP_DEFAULT_FMT_YUV422_YUYV_640X480_15FPS=y
CONFIG_CAMERA_BF3A03_DVP_IF_FORMAT_INDEX_DEFAULT=2
CONFIG_CAMERA_BF20A6=y

#
# Auto detect BF20A6
#
CONFIG_CAMERA_BF20A6_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect BF20A6

#
# Choose supported formats for DVP interface
#
CONFIG_CAMERA_BF20A6_DVP_GRAY_640X480_15FPS=y
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_BF20A6_DVP_DEFAULT_FMT_GRAY_640X480_15FPS=y
CONFIG_CAMERA_BF20A6_DVP_IF_FORMAT_INDEX_DEFAULT=0
CONFIG_CAMERA_BF3045=y

#
# Auto detect BF3045
#
CONFIG_CAMERA_BF3045_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect BF3045

#
# Choose supported formats for DVP interface
#
CONFIG_CAMERA_BF3045_DVP_RGB565_BE_640X480_15FPS=y
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_BF3045_DVP_DEFAULT_FMT_RGB565_BE_640X480_15FPS=y
CONFIG_CAMERA_BF3045_DVP_IF_FORMAT_INDEX_DEFAULT=0
CONFIG_CAMERA_GC0308=y

#
# Auto detect GC0308
#
CONFIG_CAMERA_GC0308_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect GC0308

#
# Choose supported formats for DVP interface
#
# CONFIG_CAMERA_GC0308_DVP_GRAY_320X240_20FPS is not set
# CONFIG_CAMERA_GC0308_DVP_GRAY_640X480_16FPS is not set
# CONFIG_CAMERA_GC0308_DVP_RGB565_BE_320X240_20FPS is not set
# CONFIG_CAMERA_GC0308_DVP_RGB565_BE_640X480_16FPS is not set
# CONFIG_CAMERA_GC0308_DVP_YUV422_320X240_20FPS is not set
# CONFIG_CAMERA_GC0308_DVP_YUV422_640X480_16FPS is not set
# CONFIG_CAMERA_GC0308_DVP_YUV422_YUYV_320X240_20FPS is not set
CONFIG_CAMERA_GC0308_DVP_YUV422_YUYV_640X480_16FPS=y
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_GC0308_DVP_DEFAULT_FMT_YUV422_YUYV_640X480_16FPS=y
CONFIG_CAMERA_GC0308_DVP_IF_FORMAT_INDEX_DEFAULT=7
CONFIG_CAMERA_GC2145=y

#
# Auto detect GC2145
#
CONFIG_CAMERA_GC2145_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect GC2145

#
# Choose supported formats for DVP interface
#
CONFIG_CAMERA_GC2145_DVP_RGB565_BE_640X480_15FPS=y
# CONFIG_CAMERA_GC2145_DVP_RGB565_BE_800X600_20FPS is not set
# CONFIG_CAMERA_GC2145_DVP_RGB565_BE_1600X1200_13FPS is not set
# CONFIG_CAMERA_GC2145_DVP_YUV422_320X240_13FPS is not set
# CONFIG_CAMERA_GC2145_DVP_YUV422_YUYV_320X240_13FPS is not set
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_GC2145_DVP_DEFAULT_FMT_RGB565_BE_640X480_15FPS=y
CONFIG_CAMERA_GC2145_DVP_IF_FORMAT_INDEX_DEFAULT=0
# CONFIG_CAMERA_GC2145_WRITE_REGS_DELAY_ENABLE is not set
CONFIG_CAMERA_GC2145_WRITE_REGS_DELAY_US=300
# CONFIG_CAMERA_LT6911 is not set
CONFIG_CAMERA_MT9D111=y

#
# Auto detect MT9D111
#
CONFIG_CAMERA_MT9D111_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect MT9D111

#
# Choose supported formats for DVP interface
#
# CONFIG_CAMERA_MT9D111_DVP_RGB565_BE_320X240_10FPS is not set
# CONFIG_CAMERA_MT9D111_DVP_RGB565_BE_800X600_10FPS is not set
CONFIG_CAMERA_MT9D111_DVP_RGB565_320X240_10FPS=y
# CONFIG_CAMERA_MT9D111_DVP_RGB565_800X600_10FPS is not set
# CONFIG_CAMERA_MT9D111_DVP_YUV422_800X600_8FPS is not set
# CONFIG_CAMERA_MT9D111_DVP_YUV422_800X600_14FPS is not set
# CONFIG_CAMERA_MT9D111_DVP_YUV422_800X600_16FPS is not set
# CONFIG_CAMERA_MT9D111_DVP_YUV422_YUYV_800X600_8FPS is not set
# CONFIG_CAMERA_MT9D111_DVP_YUV422_YUYV_800X600_14FPS is not set
# CONFIG_CAMERA_MT9D111_DVP_YUV422_YUYV_800X600_16FPS is not set
# end of Choose supported formats for DVP interface

