OpenEVSE/openevse_esp32_firmware/sdkconfig.defaults.esp32s3
CONFIG_CAMERA_MT9D111_DVP_DEFAULT_FMT_RGB565_320X240_10FPS=y
CONFIG_CAMERA_MT9D111_DVP_IF_FORMAT_INDEX_DEFAULT=0
CONFIG_CAMERA_OV2640=y

#
# Auto detect OV2640
#
CONFIG_CAMERA_OV2640_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect OV2640

#
# Choose supported formats for DVP interface
#
# CONFIG_CAMERA_OV2640_DVP_JPEG_320X240_50FPS is not set
# CONFIG_CAMERA_OV2640_DVP_JPEG_640X480_25FPS is not set
# CONFIG_CAMERA_OV2640_DVP_JPEG_1280X720_12FPS is not set
# CONFIG_CAMERA_OV2640_DVP_JPEG_1600X1200_12FPS is not set
# CONFIG_CAMERA_OV2640_DVP_RAW8_800X640_15FPS is not set
# CONFIG_CAMERA_OV2640_DVP_RAW8_800X640_30FPS is not set
# CONFIG_CAMERA_OV2640_DVP_RAW8_800X800_15FPS is not set
# CONFIG_CAMERA_OV2640_DVP_RAW8_1024X600_15FPS is not set
# CONFIG_CAMERA_OV2640_DVP_RGB565_BE_240X240_25FPS is not set
# CONFIG_CAMERA_OV2640_DVP_RGB565_BE_640X480_6FPS is not set
# CONFIG_CAMERA_OV2640_DVP_RGB565_240X240_25FPS is not set
# CONFIG_CAMERA_OV2640_DVP_RGB565_640X480_6FPS is not set
# CONFIG_CAMERA_OV2640_DVP_YUV422_240X240_25FPS is not set
# CONFIG_CAMERA_OV2640_DVP_YUV422_320X240_25FPS is not set
# CONFIG_CAMERA_OV2640_DVP_YUV422_640X480_6FPS is not set
# CONFIG_CAMERA_OV2640_DVP_YUV422_YUYV_240X240_25FPS is not set
# CONFIG_CAMERA_OV2640_DVP_YUV422_YUYV_320X240_25FPS is not set
CONFIG_CAMERA_OV2640_DVP_YUV422_YUYV_640X480_6FPS=y
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_OV2640_DVP_DEFAULT_FMT_YUV422_YUYV_640X480_6FPS=y
CONFIG_CAMERA_OV2640_DVP_IF_FORMAT_INDEX_DEFAULT=13
CONFIG_CAMERA_OV3660=y

#
# Auto detect OV3660
#
CONFIG_CAMERA_OV3660_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect OV3660

#
# Choose supported formats for DVP interface
#
# CONFIG_CAMERA_OV3660_DVP_YUV422_YUYV_240X240_24FPS is not set
# CONFIG_CAMERA_OV3660_DVP_RGB565_BE_240X240_24FPS is not set
# CONFIG_CAMERA_OV3660_DVP_JPEG_240X240_30FPS is not set
# CONFIG_CAMERA_OV3660_DVP_JPEG_320X240_25FPS is not set
# CONFIG_CAMERA_OV3660_DVP_JPEG_640X480_25FPS is not set
# CONFIG_CAMERA_OV3660_DVP_RGB565_BE_640X480_10FPS is not set
CONFIG_CAMERA_OV3660_DVP_YUV422_YUYV_640X480_10FPS=y
# CONFIG_CAMERA_OV3660_DVP_JPEG_1280X720_12FPS is not set
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_OV3660_DVP_DEFAULT_FMT_YUV422_YUYV_640X480_10FPS=y
CONFIG_CAMERA_OV3660_DVP_IF_FORMAT_INDEX_DEFAULT=3
CONFIG_CAMERA_OV5640=y

#
# Auto detect OV5640
#
# CONFIG_CAMERA_OV5640_AUTO_DETECT_DVP_INTERFACE_SENSOR is not set
# end of Auto detect OV5640

#
# Choose supported formats for DVP interface
#
# CONFIG_CAMERA_OV5640_DVP_RGB565_BE_800X600_10FPS is not set
# CONFIG_CAMERA_OV5640_DVP_RGB565_800X600_10FPS is not set
CONFIG_CAMERA_OV5640_DVP_YUV422_800X600_10FPS=y
# CONFIG_CAMERA_OV5640_DVP_YUV422_YUYV_800X600_10FPS is not set
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_OV5640_DVP_DEFAULT_FMT_YUV422_800X600_10FPS=y
CONFIG_CAMERA_OV5640_DVP_IF_FORMAT_INDEX_DEFAULT=0
CONFIG_CAMERA_SC030IOT=y

#
# Auto detect SC030IOT
#
CONFIG_CAMERA_SC030IOT_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect SC030IOT

#
# Choose supported formats for DVP interface
#
# CONFIG_CAMERA_SC030IOT_DVP_RAW8_640X480_26FPS is not set
CONFIG_CAMERA_SC030IOT_DVP_YUV422_640X480_26FPS=y
# CONFIG_CAMERA_SC030IOT_DVP_YUV422_YUYV_640X480_26FPS is not set
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_SC030IOT_DVP_DEFAULT_FMT_YUV422_640X480_26FPS=y
CONFIG_CAMERA_SC030IOT_DVP_IF_FORMAT_INDEX_DEFAULT=0
CONFIG_CAMERA_SC101IOT=y

#
# Auto detect SC101IOT
#
CONFIG_CAMERA_SC101IOT_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
# end of Auto detect SC101IOT

#
# Choose supported formats for DVP interface
#
CONFIG_CAMERA_SC101IOT_DVP_YUV422_1280X720_15FPS=y
# CONFIG_CAMERA_SC101IOT_DVP_YUV422_1280X720_25FPS is not set
# CONFIG_CAMERA_SC101IOT_DVP_YUV422_YUYV_1280X720_15FPS is not set
# CONFIG_CAMERA_SC101IOT_DVP_YUV422_YUYV_1280X720_25FPS is not set
# end of Choose supported formats for DVP interface

CONFIG_CAMERA_SC101IOT_DVP_DEFAULT_FMT_YUV422_1280X720_15FPS=y
CONFIG_CAMERA_SC101IOT_DVP_IF_FORMAT_INDEX_DEFAULT=0
# CONFIG_CAMERA_SC121AT is not set
# CONFIG_CAMERA_SC2336 is not set
# CONFIG_CAMERA_SP0A39 is not set
# end of Select and Set Camera Sensor
# end of Camera Sensor Configuration

#
# Camera XCLK Generator Configuration
#
CONFIG_CAMERA_XCLK_USE_LEDC=y
# end of Camera XCLK Generator Configuration

#
# Camera Motor Control Configuration
#
# CONFIG_CAM_MOTOR_DW9714 is not set
# end of Camera Motor Control Configuration

CONFIG_CAM_CTRL_DVP_ENABLE=y
CONFIG_CAM_CTRL_DVP_DMA_BUFFER_SIZE=32768
CONFIG_CAM_CTRL_DVP_TASK_STACK_SIZE=3072
CONFIG_CAM_CTRL_DVP_LOG_ENABLE=y
CONFIG_CAM_CTRL_SPI_ENABLE=y
CONFIG_CAM_CTLR_SPI_ISR_CACHE_SAFE=y
# CONFIG_CAM_CTLR_SPI_DISABLE_BACKUP_BUFFER is not set
# CONFIG_CAM_CTLR_SPI_DISABLE_AUTO_DECODE is not set
CONFIG_CAM_CTLR_SPI_DECODE_TASK_STACK_SIZE=4096
CONFIG_CAM_CTLR_SPI_DECODE_TASK_PRIORITY=10
# CONFIG_CAMERA_SENSOR_MOTOR_DETECT_METHOD_DYNAMIC_LINK is not set
CONFIG_CAMERA_SENSOR_MOTOR_DETECT_METHOD_STATIC_STORE=y
# end of Espressif Camera Sensors Configurations

#
# Diagnostics data store
#
CONFIG_DIAG_DATA_STORE_RTC=y
# CONFIG_DIAG_DATA_STORE_RAM is not set
# CONFIG_DIAG_DATA_STORE_FLASH is not set
# CONFIG_DIAG_DATA_STORE_DBG_PRINTS is not set
CONFIG_DIAG_DATA_STORE_REPORTING_WATERMARK_PERCENT=80

#
# RTC Store
#
CONFIG_RTC_STORE_DATA_SIZE=6144
CONFIG_RTC_STORE_CRITICAL_DATA_SIZE=4096
# end of RTC Store
# end of Diagnostics data store

#
# Diagnostics
#
CONFIG_DIAG_LOG_MSG_ARG_FORMAT_TLV=y
# CONFIG_DIAG_LOG_MSG_ARG_FORMAT_STRING is not set
CONFIG_DIAG_LOG_MSG_ARG_MAX_SIZE=64
CONFIG_DIAG_LOG_DROP_WIFI_LOGS=y
CONFIG_DIAG_ENABLE_WRAP_LOG_FUNCTIONS=y
CONFIG_DIAG_ENABLE_METRICS=y
CONFIG_DIAG_METRICS_MAX_COUNT=20
CONFIG_DIAG_ENABLE_HEAP_METRICS=y
CONFIG_DIAG_HEAP_POLLING_INTERVAL=30
CONFIG_DIAG_ENABLE_WIFI_METRICS=y
CONFIG_DIAG_WIFI_POLLING_INTERVAL=30
CONFIG_DIAG_ENABLE_VARIABLES=y
CONFIG_DIAG_VARIABLES_MAX_COUNT=20
CONFIG_DIAG_ENABLE_NETWORK_VARIABLES=y
# CONFIG_DIAG_MORE_NETWORK_VARS is not set
CONFIG_DIAG_USE_EXTERNAL_LOG_WRAP=y
# end of Diagnostics

#
# ESP Insights
#
CONFIG_ESP_INSIGHTS_ENABLED=y
# CONFIG_ESP_INSIGHTS_DEBUG_ENABLED is not set
# CONFIG_ESP_INSIGHTS_COREDUMP_ENABLE is not set
# CONFIG_ESP_INSIGHTS_TRANSPORT_MQTT is not set
CONFIG_ESP_INSIGHTS_TRANSPORT_HTTPS=y
CONFIG_ESP_INSIGHTS_TRANSPORT_HTTPS_HOST="https://client.insights.espressif.com"
CONFIG_ESP_INSIGHTS_CLOUD_POST_MIN_INTERVAL_SEC=60
CONFIG_ESP_INSIGHTS_CLOUD_POST_MAX_INTERVAL_SEC=240
CONFIG_ESP_INSIGHTS_META_VERSION_10=y
# end of ESP Insights

#
# JPEG Decoder
#
CONFIG_JD_USE_ROM=y
# end of JPEG Decoder

#
# CHIP Core
#

#
# General Options
#
CONFIG_MAX_EXCHANGE_CONTEXTS=8
CONFIG_MAX_FABRICS=5
CONFIG_MAX_UNSOLICITED_MESSAGE_HANDLERS=8
# CONFIG_ENABLE_PW_RPC is not set
# CONFIG_USE_MINIMAL_MDNS is not set
# CONFIG_ENABLE_CHIP_SHELL is not set
# CONFIG_ENABLE_CHIP_CONTROLLER_BUILD is not set
# CONFIG_DISABLE_IPV4 is not set
# CONFIG_DISABLE_READ_CLIENT is not set
CONFIG_ENABLE_PERSIST_SUBSCRIPTIONS=y
# CONFIG_BUILD_CHIP_TESTS is not set
CONFIG_DISPATCH_EVENT_LONG_DISPATCH_TIME_WARNING_THRESHOLD_MS=700
# CONFIG_CHIP_LOG_FILTERING is not set
# CONFIG_CHIP_SYSTEM_CONFIG_POOL_USE_HEAP is not set
CONFIG_MAX_GROUP_ENDPOINTS_PER_FABRIC=1
CONFIG_MAX_GROUPS_PER_FABRIC_PER_ENDPOINT=4
CONFIG_MAX_GROUP_KEYS_PER_FABRIC=3
# CONFIG_CHIP_DEVICE_ENABLE_DYNAMIC_SERVER is not set
# CONFIG_CHIP_MEM_ALLOC_MODE_INTERNAL is not set
# CONFIG_CHIP_MEM_ALLOC_MODE_EXTERNAL is not set
CONFIG_CHIP_MEM_ALLOC_MODE_DEFAULT=y
# end of General Options

#
# Networking Options
#
CONFIG_NUM_TCP_ENDPOINTS=8
CONFIG_NUM_UDP_ENDPOINTS=8
CONFIG_ENABLE_ROUTE_HOOK=y
CONFIG_USE_TCPIP_CORE_LOCK_FOR_THREAD_SAFETY=y
# CONFIG_USE_LWIP_PBUF_RAM_PACKETBUFFER is not set
# end of Networking Options

#
# System Options
#
CONFIG_NUM_TIMERS=32
# CONFIG_ENABLE_OTA_REQUESTOR is not set
CONFIG_CHIP_ENABLE_PAIRING_AUTOSTART=y
# CONFIG_ENABLE_SNTP_TIME_SYNC is not set
# end of System Options

#
# Security Options
#

#
# Debugging
#
# CONFIG_SECURITY_TEST_MODE is not set
# end of Debugging
# end of Security Options
# end of CHIP Core

#
# CHIP Device Layer
#

#
# General Options
#
CONFIG_CHIP_PROJECT_CONFIG=""
CONFIG_CHIP_TASK_STACK_SIZE=8192
CONFIG_CHIP_TASK_PRIORITY=1
CONFIG_MAX_EVENT_QUEUE_SIZE=40
# CONFIG_ENABLE_EXTENDED_DISCOVERY is not set
# CONFIG_ENABLE_COMMISSIONABLE_DEVICE_TYPE is not set
# CONFIG_ENABLE_BG_EVENT_PROCESSING is not set
# end of General Options

#
# Device Identification Options
#
CONFIG_DEVICE_VENDOR_ID=0xFFF1
CONFIG_DEVICE_PRODUCT_ID=0x8000
CONFIG_DEFAULT_DEVICE_HARDWARE_VERSION=0
CONFIG_DEVICE_SOFTWARE_VERSION_NUMBER=0
CONFIG_DEVICE_TYPE=0
# end of Device Identification Options

#
# WiFi Station Options
#
CONFIG_ENABLE_WIFI_STATION=y
CONFIG_DEFAULT_WIFI_SSID=""
CONFIG_DEFAULT_WIFI_PASSWORD=""
CONFIG_WIFI_STATION_RECONNECT_INTERVAL=100
CONFIG_MAX_SCAN_NETWORKS_RESULTS=10
CONFIG_WIFI_SCAN_COMPLETION_TIMEOUT=10000
CONFIG_WIFI_CONNECTIVITY_TIMEOUT=30000
# end of WiFi Station Options

#
# BLE Options
#
CONFIG_ENABLE_CHIPOBLE=y
CONFIG_BLE_DEVICE_NAME_PREFIX="MATTER-"
CONFIG_BLE_FAST_ADVERTISING_INTERVAL_MIN=40
CONFIG_BLE_FAST_ADVERTISING_INTERVAL_MAX=40
CONFIG_BLE_SLOW_ADVERTISING_INTERVAL_MIN=800
CONFIG_BLE_SLOW_ADVERTISING_INTERVAL_MAX=800
CONFIG_CHIPOBLE_SINGLE_CONNECTION=y
CONFIG_CHIPOBLE_ENABLE_ADVERTISING_AUTOSTART=0
# CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING is not set
# end of BLE Options

#
# Commissioning options
#
# CONFIG_ENABLE_ROTATING_DEVICE_ID is not set
# CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER is not set
# CONFIG_SEC_CERT_DAC_PROVIDER is not set
# CONFIG_ENABLE_ESP_INSIGHTS_TRACE is not set
# CONFIG_ENABLE_ESP_INSIGHTS_SYSTEM_STATS is not set
CONFIG_MAX_PERMIT_LIST_SIZE=20
# end of Commissioning options

#
# Diagnostics Options
#
# CONFIG_ENABLE_ESP_DIAGNOSTICS is not set
# end of Diagnostics Options

#
# Testing Options
#
CONFIG_USE_TEST_SERIAL_NUMBER="TEST_SN"
CONFIG_ENABLE_TEST_SETUP_PARAMS=y
CONFIG_TEST_EVENT_TRIGGER_ENABLED=y
CONFIG_TEST_EVENT_TRIGGER_ENABLE_KEY="00112233445566778899aabbccddeeff"
# end of Testing Options

#
# Network Telemetry Options
#
CONFIG_ENABLE_WIFI_TELEMETRY=y
# CONFIG_ENABLE_THREAD_TELEMETRY is not set
# CONFIG_ENABLE_THREAD_TELEMETRY_FULL is not set
# CONFIG_ENABLE_TUNNEL_TELEMETRY is not set
# CONFIG_ENABLE_ETHERNET_TELEMETRY is not set
# end of Network Telemetry Options

#
# Event Logging Options
#
CONFIG_EVENT_LOGGING_CRIT_BUFFER_SIZE=4096
CONFIG_EVENT_LOGGING_INFO_BUFFER_SIZE=1024
CONFIG_EVENT_LOGGING_DEBUG_BUFFER_SIZE=1024
CONFIG_CHIP_CONFIG_IM_PRETTY_PRINT=y
CONFIG_CHIP_LOG_DEFAULT_LEVEL_EQUALS_LOG_DEFAULT_LEVEL=y
# CONFIG_CHIP_LOG_DEFAULT_LEVEL_NONE is not set
# CONFIG_CHIP_LOG_DEFAULT_LEVEL_ERROR is not set
# CONFIG_CHIP_LOG_DEFAULT_LEVEL_PROGRESS is not set
# CONFIG_CHIP_LOG_DEFAULT_LEVEL_DETAIL is not set
# CONFIG_CHIP_LOG_DEFAULT_LEVEL_AUTOMATION is not set
CONFIG_CHIP_LOG_DEFAULT_LEVEL=1
# end of Event Logging Options

