OpenEVSE/openevse_esp32_firmware/sdkconfig.defaults.esp32s3
# CONFIG_CHIP_ENABLE_BDX_LOG_TRANSFER is not set

#
# Matter OTA Image
#
# CONFIG_CHIP_OTA_IMAGE_BUILD is not set
# end of Matter OTA Image

#
# External Platform
#
# CONFIG_CHIP_ENABLE_EXTERNAL_PLATFORM is not set
# end of External Platform

#
# Matter Manufacturing Options
#
CONFIG_CHIP_FACTORY_NAMESPACE_PARTITION_LABEL="nvs"
CONFIG_CHIP_CONFIG_NAMESPACE_PARTITION_LABEL="nvs"
CONFIG_CHIP_COUNTERS_NAMESPACE_PARTITION_LABEL="nvs"
CONFIG_CHIP_KVS_NAMESPACE_PARTITION_LABEL="nvs"
# end of Matter Manufacturing Options

#
# Commissioning Window Options
#
CONFIG_CHIP_DISCOVERY_TIMEOUT_SECS=900
# end of Commissioning Window Options

#
# Enable ESP32 as a BLE Commissioner
#
# CONFIG_ENABLE_ESP32_BLE_CONTROLLER is not set
# end of Enable ESP32 as a BLE Commissioner

#
# Enable BLE Extended Announcement
#
# CONFIG_ENABLE_BLE_EXT_ANNOUNCEMENT is not set
# end of Enable BLE Extended Announcement

#
# Message Reliable Protocol Options
#
CONFIG_MRP_LOCAL_ACTIVE_RETRY_INTERVAL_FOR_WIFI_ETHERNET=300
CONFIG_MRP_LOCAL_IDLE_RETRY_INTERVAL_FOR_WIFI_ETHERNET=500
CONFIG_MRP_RETRY_INTERVAL_SENDER_BOOST_FOR_WIFI_ETHERNET=0
CONFIG_MRP_MAX_RETRANS=4
# end of Message Reliable Protocol Options

#
# Matter TCP transport options
#
# CONFIG_ENABLE_TCP_TRANSPORT is not set
# end of Matter TCP transport options

#
# Network Commissioning Driver Endpoint Id
#
CONFIG_WIFI_NETWORK_COMMISSIONING_DRIVER=y
CONFIG_WIFI_NETWORK_ENDPOINT_ID=0
# end of Network Commissioning Driver Endpoint Id

#
# Cluster Configuration Options
#
# CONFIG_ENABLE_ACCESS_RESTRICTIONS is not set
# end of Cluster Configuration Options
# end of CHIP Device Layer

#
# ESP Matter
#
CONFIG_ESP_MATTER_MAX_DEVICE_TYPE_COUNT=4
CONFIG_ESP_MATTER_ATTRIBUTE_BUFFER_LARGEST=259
CONFIG_ESP_MATTER_NVS_PART_NAME="nvs"
CONFIG_ESP_MATTER_DEFERRED_ATTR_PERSISTENCE_TIME_MS=3000
CONFIG_EXAMPLE_DAC_PROVIDER=y
# CONFIG_CUSTOM_DAC_PROVIDER is not set
CONFIG_EXAMPLE_COMMISSIONABLE_DATA_PROVIDER=y
# CONFIG_SEC_CERT_COMMISSIONABLE_DATA_PROVIDER is not set
# CONFIG_CUSTOM_COMMISSIONABLE_DATA_PROVIDER is not set
CONFIG_EXAMPLE_DEVICE_INSTANCE_INFO_PROVIDER=y
# CONFIG_SEC_CERT_DEVICE_INSTANCE_INFO_PROVIDER is not set
# CONFIG_CUSTOM_DEVICE_INSTANCE_INFO_PROVIDER is not set
CONFIG_NONE_DEVICE_INFO_PROVIDER=y
# CONFIG_CUSTOM_DEVICE_INFO_PROVIDER is not set
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=32
CONFIG_ESP_MATTER_MODE_SELECT_CLUSTER_ENDPOINT_COUNT=0
CONFIG_ESP_MATTER_TEMPERATURE_CONTROL_CLUSTER_ENDPOINT_COUNT=0
CONFIG_ESP_MATTER_SCENES_TABLE_SIZE=16
CONFIG_ESP_MATTER_BINDING_TABLE_SIZE=2
CONFIG_ESP_MATTER_MEM_ALLOC_MODE_INTERNAL=y
# CONFIG_ESP_MATTER_MEM_ALLOC_MODE_EXTERNAL is not set
# CONFIG_ESP_MATTER_MEM_ALLOC_MODE_DEFAULT is not set
CONFIG_ESP_MATTER_ENABLE_DATA_MODEL=y
CONFIG_ESP_MATTER_ENABLE_MATTER_SERVER=y
CONFIG_ESP_MATTER_ENABLE_OPENTHREAD=y
# CONFIG_CUSTOM_NETWORK_CONFIG is not set

#
# Select Supported Matter Clusters
#
CONFIG_SUPPORT_ACCESS_CONTROL_CLUSTER=y
# CONFIG_SUPPORT_ACCOUNT_LOGIN_CLUSTER is not set
CONFIG_SUPPORT_ACTIONS_CLUSTER=y
# CONFIG_SUPPORT_ACTIVATED_CARBON_FILTER_MONITORING_CLUSTER is not set
CONFIG_SUPPORT_ADMINISTRATOR_COMMISSIONING_CLUSTER=y
CONFIG_SUPPORT_AIR_QUALITY_CLUSTER=y
CONFIG_SUPPORT_APPLICATION_BASIC_CLUSTER=y
# CONFIG_SUPPORT_APPLICATION_LAUNCHER_CLUSTER is not set
# CONFIG_SUPPORT_AUDIO_OUTPUT_CLUSTER is not set
CONFIG_SUPPORT_BASIC_INFORMATION_CLUSTER=y
CONFIG_SUPPORT_BINDING_CLUSTER=y
CONFIG_SUPPORT_BOOLEAN_STATE_CLUSTER=y
CONFIG_SUPPORT_BOOLEAN_STATE_CONFIGURATION_CLUSTER=y
# CONFIG_SUPPORT_BRIDGED_DEVICE_BASIC_INFORMATION_CLUSTER is not set
CONFIG_SUPPORT_CAMERA_AV_SETTINGS_USER_LEVEL_MANAGEMENT_CLUSTER=y
CONFIG_SUPPORT_CAMERA_AV_STREAM_MANAGEMENT_CLUSTER=y
CONFIG_SUPPORT_CARBON_DIOXIDE_CONCENTRATION_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_CARBON_MONOXIDE_CONCENTRATION_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_CHANNEL_CLUSTER=y
CONFIG_SUPPORT_CHIME_CLUSTER=y
CONFIG_SUPPORT_CLOSURE_CONTROL_CLUSTER=y
CONFIG_SUPPORT_CLOSURE_DIMENSION_CLUSTER=y
CONFIG_SUPPORT_COLOR_CONTROL_CLUSTER=y
# CONFIG_SUPPORT_COMMISSIONER_CONTROL_CLUSTER is not set
CONFIG_SUPPORT_COMMODITY_METERING_CLUSTER=y
CONFIG_SUPPORT_COMMODITY_PRICE_CLUSTER=y
CONFIG_SUPPORT_COMMODITY_TARIFF_CLUSTER=y
# CONFIG_SUPPORT_CONTENT_LAUNCHER_CLUSTER is not set
# CONFIG_SUPPORT_CONTENT_CONTROL_CLUSTER is not set
# CONFIG_SUPPORT_CONTENT_APP_OBSERVER_CLUSTER is not set
CONFIG_SUPPORT_DESCRIPTOR_CLUSTER=y
CONFIG_SUPPORT_DEVICE_ENERGY_MANAGEMENT_CLUSTER=y
CONFIG_SUPPORT_DEVICE_ENERGY_MANAGEMENT_MODE_CLUSTER=y
# CONFIG_SUPPORT_DIAGNOSTIC_LOGS_CLUSTER is not set
# CONFIG_SUPPORT_DISHWASHER_ALARM_CLUSTER is not set
# CONFIG_SUPPORT_DISHWASHER_MODE_CLUSTER is not set
CONFIG_SUPPORT_ELECTRICAL_GRID_CONDITIONS_CLUSTER=y
CONFIG_SUPPORT_GROUPCAST_CLUSTER=y
CONFIG_SUPPORT_METER_IDENTIFICATION_CLUSTER=y
# CONFIG_SUPPORT_MICROWAVE_OVEN_MODE_CLUSTER is not set
CONFIG_SUPPORT_DOOR_LOCK_CLUSTER=y
# CONFIG_SUPPORT_ECOSYSTEM_INFORMATION_CLUSTER is not set
CONFIG_SUPPORT_ELECTRICAL_ENERGY_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_ELECTRICAL_POWER_MEASUREMENT_CLUSTER=y
# CONFIG_SUPPORT_ENERGY_EVSE_CLUSTER is not set
# CONFIG_SUPPORT_ENERGY_EVSE_MODE_CLUSTER is not set
# CONFIG_SUPPORT_ETHERNET_NETWORK_DIAGNOSTICS_CLUSTER is not set
CONFIG_SUPPORT_ENERGY_PREFERENCE_CLUSTER=y
CONFIG_SUPPORT_FAN_CONTROL_CLUSTER=y
# CONFIG_SUPPORT_FAULT_INJECTION_CLUSTER is not set
CONFIG_SUPPORT_FIXED_LABEL_CLUSTER=y
CONFIG_SUPPORT_FORMALDEHYDE_CONCENTRATION_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_GENERAL_COMMISSIONING_CLUSTER=y
CONFIG_SUPPORT_GENERAL_DIAGNOSTICS_CLUSTER=y
CONFIG_SUPPORT_GROUPS_CLUSTER=y
# CONFIG_SUPPORT_HEPA_FILTER_MONITORING_CLUSTER is not set
CONFIG_SUPPORT_GROUP_KEY_MANAGEMENT_CLUSTER=y
CONFIG_SUPPORT_ICD_MANAGEMENT_CLUSTER=y
CONFIG_SUPPORT_IDENTIFY_CLUSTER=y
CONFIG_SUPPORT_JOINT_FABRIC_DATASTORE_CLUSTER=y
CONFIG_SUPPORT_JOINT_FABRIC_ADMINISTRATOR_CLUSTER=y
# CONFIG_SUPPORT_KEYPAD_INPUT_CLUSTER is not set
# CONFIG_SUPPORT_LAUNDRY_WASHER_MODE_CLUSTER is not set
CONFIG_SUPPORT_LEVEL_CONTROL_CLUSTER=y
# CONFIG_SUPPORT_LOCALIZATION_CONFIGURATION_CLUSTER is not set
CONFIG_SUPPORT_LOW_POWER_CLUSTER=y
# CONFIG_SUPPORT_MEDIA_INPUT_CLUSTER is not set
# CONFIG_SUPPORT_MEDIA_PLAYBACK_CLUSTER is not set
# CONFIG_SUPPORT_MICROWAVE_OVEN_CONTROL_CLUSTER is not set
CONFIG_SUPPORT_MESSAGES_CLUSTER=y
CONFIG_SUPPORT_MODE_SELECT_CLUSTER=y
CONFIG_SUPPORT_NETWORK_COMMISSIONING_CLUSTER=y
CONFIG_SUPPORT_NITROGEN_DIOXIDE_CONCENTRATION_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_PUSH_AV_STREAM_TRANSPORT_CLUSTER=y
# CONFIG_SUPPORT_SAMPLE_MEI_CLUSTER is not set
CONFIG_SUPPORT_OCCUPANCY_SENSING_CLUSTER=y
CONFIG_SUPPORT_ON_OFF_CLUSTER=y
# CONFIG_SUPPORT_POWER_TOPOLOGY_CLUSTER is not set
CONFIG_SUPPORT_OPERATIONAL_CREDENTIALS_CLUSTER=y
CONFIG_SUPPORT_OPERATIONAL_STATE_CLUSTER=y
# CONFIG_SUPPORT_OPERATIONAL_STATE_OVEN_CLUSTER is not set
# CONFIG_SUPPORT_OPERATIONAL_STATE_RVC_CLUSTER is not set
# CONFIG_SUPPORT_OTA_SOFTWARE_UPDATE_PROVIDER_CLUSTER is not set
# CONFIG_SUPPORT_OTA_SOFTWARE_UPDATE_REQUESTOR_CLUSTER is not set
# CONFIG_SUPPORT_OVEN_MODE_CLUSTER is not set
CONFIG_SUPPORT_OZONE_CONCENTRATION_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_PM10_CONCENTRATION_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_PM1_CONCENTRATION_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_PM2_5_CONCENTRATION_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_POWER_SOURCE_CLUSTER=y
CONFIG_SUPPORT_POWER_SOURCE_CONFIGURATION_CLUSTER=y
# CONFIG_SUPPORT_PUMP_CONFIGURATION_AND_CONTROL_CLUSTER is not set
# CONFIG_SUPPORT_RADON_CONCENTRATION_MEASUREMENT_CLUSTER is not set
# CONFIG_SUPPORT_REFRIGERATOR_ALARM_CLUSTER is not set
# CONFIG_SUPPORT_REFRIGERATOR_AND_TEMPERATURE_CONTROLLED_CABINET_MODE_CLUSTER is not set
# CONFIG_SUPPORT_RVC_CLEAN_MODE_CLUSTER is not set
# CONFIG_SUPPORT_RVC_RUN_MODE_CLUSTER is not set
CONFIG_SUPPORT_SCENES_CLUSTER=y
# CONFIG_SUPPORT_SERVICE_AREA_CLUSTER is not set
# CONFIG_SUPPORT_SMOKE_CO_ALARM_CLUSTER is not set
# CONFIG_SUPPORT_SOFTWARE_DIAGNOSTICS_CLUSTER is not set
CONFIG_SUPPORT_SOIL_MEASUREMENT_CLUSTER=y
CONFIG_SUPPORT_SWITCH_CLUSTER=y
# CONFIG_SUPPORT_TARGET_NAVIGATOR_CLUSTER is not set
CONFIG_SUPPORT_TEMPERATURE_CONTROL_CLUSTER=y
CONFIG_SUPPORT_THERMOSTAT_CLUSTER=y
CONFIG_SUPPORT_THERMOSTAT_USER_INTERFACE_CONFIGURATION_CLUSTER=y
CONFIG_SUPPORT_THREAD_BORDER_ROUTER_MANAGEMENT_CLUSTER=y
CONFIG_SUPPORT_THREAD_NETWORK_DIAGNOSTICS_CLUSTER=y
CONFIG_SUPPORT_THREAD_NETWORK_DIRECTORY_CLUSTER=y
CONFIG_SUPPORT_TIME_FORMAT_LOCALIZATION_CLUSTER=y
CONFIG_SUPPORT_TIME_SYNCHRONIZATION_CLUSTER=y
CONFIG_SUPPORT_TIMER_CLUSTER=y
CONFIG_SUPPORT_TLS_CERTIFICATE_MANAGEMENT_CLUSTER=y
CONFIG_SUPPORT_TLS_CLIENT_MANAGEMENT_CLUSTER=y
# CONFIG_SUPPORT_TVOC_CONCENTRATION_MEASUREMENT_CLUSTER is not set
CONFIG_SUPPORT_UNIT_LOCALIZATION_CLUSTER=y
CONFIG_SUPPORT_UNIT_TESTING_CLUSTER=y
CONFIG_SUPPORT_USER_LABEL_CLUSTER=y
# CONFIG_SUPPORT_VALVE_CONFIGURATION_AND_CONTROL_CLUSTER is not set
# CONFIG_SUPPORT_WAKE_ON_LAN_CLUSTER is not set
# CONFIG_SUPPORT_LAUNDRY_WASHER_CONTROLS_CLUSTER is not set
# CONFIG_SUPPORT_LAUNDRY_DRYER_CONTROLS_CLUSTER is not set
CONFIG_SUPPORT_WEB_RTC_TRANSPORT_PROVIDER_CLUSTER=y
CONFIG_SUPPORT_WEB_RTC_TRANSPORT_REQUESTOR_CLUSTER=y
CONFIG_SUPPORT_WIFI_NETWORK_DIAGNOSTICS_CLUSTER=y
CONFIG_SUPPORT_WIFI_NETWORK_MANAGEMENT_CLUSTER=y
CONFIG_SUPPORT_WINDOW_COVERING_CLUSTER=y
# CONFIG_SUPPORT_WATER_HEATER_MANAGEMENT_CLUSTER is not set
# CONFIG_SUPPORT_WATER_HEATER_MODE_CLUSTER is not set
CONFIG_SUPPORT_ZONE_MANAGEMENT_CLUSTER=y
# end of Select Supported Matter Clusters
# end of ESP Matter

#
# ESP Matter Bridge
#
CONFIG_ESP_MATTER_AGGREGATOR_ENDPOINT_COUNT=1
CONFIG_ESP_MATTER_BRIDGE_INFO_PART_NAME="nvs"
# end of ESP Matter Bridge

#
# ESP Matter Console
#
CONFIG_ESP_MATTER_CONSOLE_TASK_STACK=2048
CONFIG_ESP_MATTER_CONSOLE_MAX_COMMANDS=10
# end of ESP Matter Console

#
# ESP Matter Controller
#
# CONFIG_ESP_MATTER_CONTROLLER_ENABLE is not set
# end of ESP Matter Controller

#
# ESP Matter OTA Provider
#
# CONFIG_ESP_MATTER_OTA_PROVIDER_ENABLED is not set
# end of ESP Matter OTA Provider

#
# esp-modem
#
CONFIG_ESP_MODEM_CMUX_DEFRAGMENT_PAYLOAD=y
CONFIG_ESP_MODEM_USE_INFLATABLE_BUFFER_IF_NEEDED=y
CONFIG_ESP_MODEM_CMUX_DELAY_AFTER_DLCI_SETUP=0
CONFIG_ESP_MODEM_CMUX_DELAY_AFTER_NETIF_DISCONNECT=0
# CONFIG_ESP_MODEM_CMUX_USE_SHORT_PAYLOADS_ONLY is not set
# CONFIG_ESP_MODEM_ADD_CUSTOM_MODULE is not set
CONFIG_ESP_MODEM_C_API_STR_MAX=128
# CONFIG_ESP_MODEM_URC_HANDLER is not set
# CONFIG_ESP_MODEM_PPP_ESCAPE_BEFORE_EXIT is not set
# CONFIG_ESP_MODEM_ADD_DEBUG_LOGS is not set
# CONFIG_ESP_MODEM_ENABLE_DEVELOPMENT_MODE is not set
CONFIG_ESP_MODEM_USE_PPP_MODE=y
# end of esp-modem

#
# OpenThread RCP Update
#
# CONFIG_AUTO_UPDATE_RCP is not set
# CONFIG_CREATE_OTA_IMAGE_WITH_RCP_FW is not set
# end of OpenThread RCP Update

#
# Espressif SCCB Configurations
#
CONFIG_ESP_SCCB_TRANS_TIMEOUT_DEFAULT=500
# end of Espressif SCCB Configurations

#
# ESP Schedule Configuration
#
CONFIG_ESP_SCHEDULE_ENABLE_DAYLIGHT=y
# end of ESP Schedule Configuration

#
# ESP Secure Cert Manager
#
CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=y
# CONFIG_ESP_SECURE_CERT_SUPPORT_LEGACY_FORMATS is not set
# CONFIG_ESP_SECURE_CERT_WRITE_ENABLE_LOGGING is not set
# end of ESP Secure Cert Manager

#
# Espressif Video Configuration
#
CONFIG_ESP_VIDEO_CHECK_PARAMETERS=y
CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=y
# CONFIG_ESP_VIDEO_ENABLE_SPI_VIDEO_DEVICE is not set
# CONFIG_ESP_VIDEO_ENABLE_USB_UVC_VIDEO_DEVICE is not set

#
# Video Data Preprocessing
#
# end of Video Data Preprocessing
# end of Espressif Video Configuration

#
# jsmn
#
# CONFIG_JSMN_PARENT_LINKS is not set
# CONFIG_JSMN_STRICT is not set
# CONFIG_JSMN_STATIC is not set
# end of jsmn

#
# libsodium
#
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y
# end of libsodium

#
# mDNS
#
CONFIG_MDNS_MAX_INTERFACES=3
CONFIG_MDNS_MAX_SERVICES=10
CONFIG_MDNS_TASK_PRIORITY=1
CONFIG_MDNS_ACTION_QUEUE_LEN=16
CONFIG_MDNS_TASK_STACK_SIZE=4096
# CONFIG_MDNS_TASK_AFFINITY_NO_AFFINITY is not set
CONFIG_MDNS_TASK_AFFINITY_CPU0=y
# CONFIG_MDNS_TASK_AFFINITY_CPU1 is not set
CONFIG_MDNS_TASK_AFFINITY=0x0

#
# MDNS Memory Configuration
#
# CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM is not set
CONFIG_MDNS_TASK_CREATE_FROM_INTERNAL=y
# CONFIG_MDNS_MEMORY_ALLOC_SPIRAM is not set
CONFIG_MDNS_MEMORY_ALLOC_INTERNAL=y
# CONFIG_MDNS_MEMORY_CUSTOM_IMPL is not set
# end of MDNS Memory Configuration

CONFIG_MDNS_SERVICE_ADD_TIMEOUT_MS=2000
CONFIG_MDNS_TIMER_PERIOD_MS=100
# CONFIG_MDNS_NETWORKING_SOCKET is not set
# CONFIG_MDNS_SKIP_SUPPRESSING_OWN_QUERIES is not set
# CONFIG_MDNS_ENABLE_DEBUG_PRINTS is not set
CONFIG_MDNS_ENABLE_CONSOLE_CLI=y
# CONFIG_MDNS_RESPOND_REVERSE_QUERIES is not set
CONFIG_MDNS_MULTIPLE_INSTANCE=y

#
# MDNS Predefined interfaces
#
CONFIG_MDNS_PREDEF_NETIF_STA=y
CONFIG_MDNS_PREDEF_NETIF_AP=y
CONFIG_MDNS_PREDEF_NETIF_ETH=y
# end of MDNS Predefined interfaces
# end of mDNS

#
# Network Provisioning Manager
#
CONFIG_NETWORK_PROV_NETWORK_TYPE_WIFI=y
CONFIG_NETWORK_PROV_SCAN_MAX_ENTRIES=16
CONFIG_NETWORK_PROV_AUTOSTOP_TIMEOUT=30
# CONFIG_NETWORK_PROV_BLE_BONDING is not set
CONFIG_NETWORK_PROV_BLE_SEC_CONN=y
# CONFIG_NETWORK_PROV_BLE_FORCE_ENCRYPTION is not set
# CONFIG_NETWORK_PROV_KEEP_BLE_ON_AFTER_PROV is not set
CONFIG_NETWORK_PROV_WIFI_STA_ALL_CHANNEL_SCAN=y
# CONFIG_NETWORK_PROV_WIFI_STA_FAST_SCAN is not set
# end of Network Provisioning Manager

#
# ESP RainMaker Command-Response
#
CONFIG_ESP_RMAKER_MAX_COMMANDS=10
# end of ESP RainMaker Command-Response

#
# ESP RainMaker Common
#
CONFIG_ESP_RMAKER_LIB_ESP_MQTT=y
# CONFIG_ESP_RMAKER_LIB_AWS_IOT is not set
CONFIG_ESP_RMAKER_MQTT_GLUE_LIB=1
CONFIG_ESP_RMAKER_MQTT_PORT_443=y
# CONFIG_ESP_RMAKER_MQTT_PORT_8883 is not set
CONFIG_ESP_RMAKER_MQTT_PORT=1
# CONFIG_ESP_RMAKER_MQTT_PERSISTENT_SESSION is not set
CONFIG_ESP_RMAKER_MQTT_SEND_USERNAME=y
CONFIG_ESP_RMAKER_MQTT_PRODUCT_NAME="RMDev"
CONFIG_ESP_RMAKER_MQTT_PRODUCT_VERSION="1x0"
CONFIG_ESP_RMAKER_MQTT_PRODUCT_SKU="EX00"
CONFIG_ESP_RMAKER_MQTT_USE_CERT_BUNDLE=y
CONFIG_ESP_RMAKER_MAX_MQTT_SUBSCRIPTIONS=10
CONFIG_ESP_RMAKER_MQTT_KEEP_ALIVE_INTERVAL=120
CONFIG_ESP_RMAKER_FACTORY_PARTITION_NAME="fctry"
CONFIG_ESP_RMAKER_FACTORY_NAMESPACE="rmaker_creds"
# end of ESP RainMaker Common

#
# ESP RainMaker Console
#
CONFIG_ESP_RMAKER_CONSOLE_ENABLED=y
CONFIG_ESP_RMAKER_CONSOLE_TASK_STACK=4096
CONFIG_ESP_RMAKER_CONSOLE_TASK_PRIORITY=5
# end of ESP RainMaker Console

#
# ESP RainMaker Time Sync
#
CONFIG_ESP_RMAKER_DEF_TIMEZONE="Asia/Shanghai"
CONFIG_ESP_RMAKER_SNTP_SERVER_NAME="pool.ntp.org"
# end of ESP RainMaker Time Sync

#
# ESP RainMaker Work Queue
#
CONFIG_ESP_RMAKER_WORK_QUEUE_TASK_STACK=5120
CONFIG_ESP_RMAKER_WORK_QUEUE_TASK_PRIORITY=5
# end of ESP RainMaker Work Queue

#
# USB HOST UVC
#
# CONFIG_UVC_PRINTF_CONFIGURATION_DESCRIPTOR is not set
CONFIG_UVC_INTERVAL_ARRAY_SIZE=3
CONFIG_UVC_CHECK_PAYLOAD_HEADER_EOH=y
# end of USB HOST UVC

#
# LittleFS
#
# CONFIG_LITTLEFS_SDMMC_SUPPORT is not set
CONFIG_LITTLEFS_MAX_PARTITIONS=3
CONFIG_LITTLEFS_PAGE_SIZE=256
CONFIG_LITTLEFS_OBJ_NAME_LEN=64
CONFIG_LITTLEFS_READ_SIZE=128
CONFIG_LITTLEFS_WRITE_SIZE=128
CONFIG_LITTLEFS_LOOKAHEAD_SIZE=128
CONFIG_LITTLEFS_CACHE_SIZE=512
CONFIG_LITTLEFS_BLOCK_CYCLES=512
CONFIG_LITTLEFS_USE_MTIME=y
# CONFIG_LITTLEFS_USE_ONLY_HASH is not set
# CONFIG_LITTLEFS_HUMAN_READABLE is not set
CONFIG_LITTLEFS_MTIME_USE_SECONDS=y
# CONFIG_LITTLEFS_MTIME_USE_NONCE is not set
# CONFIG_LITTLEFS_SPIFFS_COMPAT is not set
# CONFIG_LITTLEFS_FLUSH_FILE_EVERY_WRITE is not set
# CONFIG_LITTLEFS_FCNTL_GET_PATH is not set
# CONFIG_LITTLEFS_MULTIVERSION is not set
# CONFIG_LITTLEFS_MALLOC_STRATEGY_DISABLE is not set
CONFIG_LITTLEFS_MALLOC_STRATEGY_DEFAULT=y
# CONFIG_LITTLEFS_MALLOC_STRATEGY_INTERNAL is not set
# CONFIG_LITTLEFS_MALLOC_STRATEGY_SPIRAM is not set
# CONFIG_LITTLEFS_MALLOC_STRATEGY_SPIRAM_PREFER is not set
CONFIG_LITTLEFS_ASSERTS=y
# CONFIG_LITTLEFS_MMAP_PARTITION is not set
# CONFIG_LITTLEFS_WDT_RESET is not set
# end of LittleFS
# end of Component config

# CONFIG_IDF_EXPERIMENTAL_FEATURES is not set

